//Гончигсумлай хоолны газар оров.
//Орсон хоолны газар нь 5000₮ - 30000₮ хооронд
//15% нэмж төлдөг, бусад үед 20% - ийг нэмж төлдөг бол.
//Эдгээр тохиолдолуудад нийт хэдийг төлөхийг олно уу.
//Эдгээр тохиолдолуудад тус бүр хэдийг төлөх вэ? 3000₮, 27500₮, 100000₮. 
//(if else ашиглахгүй ternary operator ашиглаарай).
const tip1 = 3000;
const tip2 = 27500;
const tip3 = 100000;

if (5000 >= tip1 && 30000 <= tip1) {
    console.log('bodlogo bodoh 15%')
} else {
    console.log('busad bodoh 20%')
} 

